fortus documentation/RateBridge/soaprequest_1.xml

<soap:Envelope 
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <Caller xmlns="http://www.compu-quote.com/RateBridge/Version1">
      <Name>mycallingapp.dll</Name>
      <Version>1.0.1.54</Version>
      <Product>ThirdParty_Web</Product>
      <LineOfBusiness>AUTO</LineOfBusiness>
      <Province>AB</Province>
      <Language>EN</Language>
      <FortusVersion>
        <MajorVersion>5</MajorVersion>
        <MinorVersion>8</MinorVersion>
        <Build>2</Build>
      </FortusVersion>
    </Caller>
    <CQCredentials xmlns="http://www.compu-quote.com/RateBridge/Version1">
      <UserName>Username1</UserName>
      <Password>UGFzc3dvcmQx</Password>
    </CQCredentials>
  </soap:Header>
  <soap:Body>
    <Rate xmlns="http://www.compu-quote.com/RateBridge/Version1">
      <QuoteGUID>3989337B2869470388DB7478B0206AD4</QuoteGUID>
      <QuoteIterationGUID>D98236C5E59143618D7DF79AF858A236</QuoteIterationGUID>
      <xmlparam_FortusTransaction>
        <FortusTransaction Type="Automobile" xmlns="">
          <Province>AB</Province>
          <Renewal>NO</Renewal>
          <CodeNames>
            <Auto>
              <QuoteInfo>
                <CoverageOverride>More</CoverageOverride>
                <ID>00000243</ID>
                <Language>English</Language>
                <TransactionDate>20090331</TransactionDate>
                <Vehicle>
                  <AirBag>None</AirBag>
                  <DistanceDaily>10</DistanceDaily>
                  <DistanceYearly>10000</DistanceYearly>
                  <ID>00000215</ID>
                  <Location>EDMONTON</Location>
                  <LocationIndex>619</LocationIndex>
                  <MakeAndModel>ESCORT LX 4DR</MakeAndModel>
                  <Manufacturer>FORD</Manufacturer>
                  <Owned>Y</Owned>
                  <PostalCode>T6E1J1</PostalCode>
                  <ProductLine>Personal</ProductLine>
                  <PurchaseDate>19990101</PurchaseDate>
                  <PurchasedNew>Y</PurchasedNew>
                  <VehType>Private Passenger</VehType>
                  <VehUse>Pleasure</VehUse>
                  <VICCCode>3414</VICCCode>
                  <Year>1999</Year>
                  <Coverage>
                    <CSIOCode>TP</CSIOCode>
                    <ID>01</ID>
                    <Limit1>1000000</Limit1>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>AB</CSIOCode>
                    <ID>02</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>COL</CSIOCode>
                    <Deductible>250</Deductible>
                    <ID>03</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>CMP</CSIOCode>
                    <Deductible>250</Deductible>
                    <ID>04</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>5A</CSIOCode>
                    <ID>05</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>20</CSIOCode>
                    <ID>06</ID>
                    <Limit2>1000</Limit2>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>27</CSIOCode>
                    <ID>07</ID>
                    <Limit1>50000</Limit1>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>35</CSIOCode>
                    <ID>08</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>43</CSIOCode>
                    <ID>09</ID>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>44</CSIOCode>
                    <ID>10</ID>
                    <Limit1>1000000</Limit1>
                  </Coverage>
                  <Coverage>
                    <CSIOCode>ACCW</CSIOCode>
                    <ID>11</ID>
                  </Coverage>
                </Vehicle>
                <Claim>
                  <AmountBI>100</AmountBI>
                  <AmountTotal>100</AmountTotal>
                  <ClaimDate>20080101</ClaimDate>
                  <ClaimType>Hail</ClaimType>
                  <DriverID>00000216</DriverID>
                  <Forgiven>N</Forgiven>
                  <ID>00000114</ID>
                  <VehicleID>00000215</VehicleID>
                </Claim>
                <Incident>
                  <DateReinstated>20080701</DateReinstated>
                  <DriverID>00000216</DriverID>
                  <ID>00000129</ID>
                  <IncidentDate>20080101</IncidentDate>
                  <IncidentType>Lic Susp</IncidentType>
                  <Reason>Alcohol</Reason>
                </Incident>
                <DriverProfile>
                  <Birthdate>19650101</Birthdate>
                  <DateContinuousInsurance>19830101</DateContinuousInsurance>
                  <DateWithBroker>19830101</DateWithBroker>
                  <DateWithCompany>19830101</DateWithCompany>
                  <DistanceSchool>22</DistanceSchool>
                  <DriverTraining>Y</DriverTraining>
                  <Gender>M</Gender>
                  <GridLevel>7</GridLevel>
                  <GridLevelEffDate>20090316</GridLevelEffDate>
                  <GridLevelGiven>Y</GridLevelGiven>
                  <ID>00000216</ID>
                  <MaritalStatus>M</MaritalStatus>
                  <OccupationCode>999</OccupationCode>
                  <RelationshipToApplicant>Applicant</RelationshipToApplicant>
                  <RemedialTrainingDate>19940101</RemedialTrainingDate>
                  <ResidesWithParents>Y</ResidesWithParents>
                  <DriverLicense>
                    <Country>CA</Country>
                    <ID>1</ID>
                    <LicenseClass>G</LicenseClass>
                    <LicenseDate>19860101</LicenseDate>
                    <ProvinceState>AB</ProvinceState>
                  </DriverLicense>
                  <DriverLicense>
                    <Country>CA</Country>
                    <ID>2</ID>
                    <LicenseClass>G2</LicenseClass>
                    <LicenseDate>19840101</LicenseDate>
                    <ProvinceState>AB</ProvinceState>
                  </DriverLicense>
                  <DriverLicense>
                    <Country>CA</Country>
                    <ID>3</ID>
                    <LicenseClass>G1</LicenseClass>
                    <LicenseDate>19830101</LicenseDate>
                    <ProvinceState>AB</ProvinceState>
                  </DriverLicense>
                  <GroupPlan>
                    <DateMembership>20090101</DateMembership>
                    <GroupPlanDescr>GROU15</GroupPlanDescr>
                    <ID>1</ID>
                  </GroupPlan>
                </DriverProfile>
                <DriverProfile>
                  <Birthdate>19650101</Birthdate>
                  <DateContinuousInsurance>19810101</DateContinuousInsurance>
                  <DateWithBroker>19830101</DateWithBroker>
                  <DateWithCompany>19830101</DateWithCompany>
                  <DriverTraining>N</DriverTraining>
                  <Gender>F</Gender>
                  <GridLevelEffDate>20090323</GridLevelEffDate>
                  <ID>00000217</ID>
                  <MaritalStatus>M</MaritalStatus>
                  <OccupationCode>999</OccupationCode>
                  <RelationshipToApplicant>Spouse</RelationshipToApplicant>
                  <DriverLicense>
                    <Country>CA</Country>
                    <ID>1</ID>
                    <LicenseClass>G</LicenseClass>
                    <LicenseDate>19810101</LicenseDate>
                    <ProvinceState>AB</ProvinceState>
                  </DriverLicense>
                </DriverProfile>
                <VehLink>
                  <DateOwnerPrincipal>19830101</DateOwnerPrincipal>
                  <DriverID>00000216</DriverID>
                  <ID>1</ID>
                  <Link>Prn</Link>
                  <PrincipalOwner>Y</PrincipalOwner>
                  <VehicleID>00000215</VehicleID>
                </VehLink>
                <VehLink>
                  <DriverID>00000217</DriverID>
                  <ID>2</ID>
                  <Link>Occ</Link>
                  <PercentUse>100</PercentUse>
                  <PrincipalOwner>N</PrincipalOwner>
                  <VehicleID>00000215</VehicleID>
                </VehLink>
                <Claim>
                  <AmountCOL>2000</AmountCOL>
                  <AmountTotal>2000</AmountTotal>
                  <ClaimDate>20090101</ClaimDate>
                  <ClaimType>Collision</ClaimType>
                  <DriverID>00000216</DriverID>
                  <ID>00000115</ID>
                  <PercentAtFault>100</PercentAtFault>
                  <VehicleID>00000215</VehicleID>
                </Claim>
                <Incident>
                  <DateReinstated>20090301</DateReinstated>
                  <DriverID>00000216</DriverID>
                  <ID>00000130</ID>
                  <IncidentDate>20090101</IncidentDate>
                  <IncidentType>Ins Lapse</IncidentType>
                  <Reason>DWOI</Reason>
                </Incident>
                <TermRequested>12</TermRequested>
                <ProductName>Web</ProductName>
              </QuoteInfo>
            </Auto>
          </CodeNames>
          <EffDate>20090331</EffDate>
          <Carriers>
            <Carrier>GRP</Carrier>
            <Carrier>WU</Carrier>
            <Carrier>AXA</Carrier>
          </Carriers>
        </FortusTransaction>
      </xmlparam_FortusTransaction>
      <xmlparam_ExtendedInput>
        <FortusTransaction xmlns="">
          <Province>AB</Province>
          <QuoteGUID>3989337B2869470388DB7478B0206AD4</QuoteGUID>
          <CodeNames>
            <Auto>
              <QuoteInfo>
                <ID>00000243</ID>
                <CreditScore>
                  <Birthdate>19710101</Birthdate>
                  <ID>1</ID>
                  <PartyType>IN</PartyType>
                  <Address>
                    <Address1>923 21st St.</Address1>
                    <City>Edmonton</City>
                    <Classification>Insured</Classification>
                    <ID>1</ID>
                    <PostalCode>T6E1J1</PostalCode>
                    <Province>AB</Province>
                  </Address>
                  <Name>
                    <Classification>Insured</Classification>
                    <FirstName>Client</FirstName>
                    <ID>1</ID>
                    <LastName>Alberta</LastName>
                  </Name>
                  <Telephone>
                    <AreaCode>981</AreaCode>
                    <Classification>Insured</Classification>
                    <ID>1</ID>
                    <Number>4871239</Number>
                  </Telephone>
                </CreditScore>
                <Client>
                  <CSRCode>PC</CSRCode>
                  <ID>000000000000103</ID>
                  <Name>
                    <Classification>Client</Classification>
                    <FirstName>John</FirstName>
                    <ID>1</ID>
                    <LastName>Doe</LastName>
                    <Salutation>Mr.</Salutation>
                  </Name>
                  <Address>
                    <Address1>923 21st St.</Address1>
                    <City>Edmonton</City>
                    <Classification>Client</Classification>
                    <ID>1</ID>
                    <PostalCode>T6E1J1</PostalCode>
                    <Province>AB</Province>
                  </Address>
                  <Telephone>
                    <AreaCode>981</AreaCode>
                    <Classification>Home</Classification>
                    <ID>1</ID>
                    <Number>4871239</Number>
                  </Telephone>
                </Client>
                <Vehicle>
                  <ID>00000215</ID>
                </Vehicle>
                <DriverProfile>
                  <ID>00000216</ID>
                  <GroupPlan>
                    <ID>1</ID>
                  </GroupPlan>
                  <DriverLicense>
                    <ID>1</ID>
                  </DriverLicense>
                  <Name>
                    <Classification>Driver</Classification>
                    <FirstName>John</FirstName>
                    <ID>1</ID>
                    <LastName>Doe</LastName>
                    <Salutation>Mr.</Salutation>
                  </Name>
                  <DriverLicense>
                    <ID>2</ID>
                  </DriverLicense>
                  <DriverLicense>
                    <ID>3</ID>
                  </DriverLicense>
                </DriverProfile>
                <DriverProfile>
                  <ID>00000217</ID>
                  <DriverLicense>
                    <ID>1</ID>
                  </DriverLicense>
                  <Name>
                    <Classification>Driver</Classification>
                    <FirstName>Jane</FirstName>
                    <ID>1</ID>
                    <LastName>Doe</LastName>
                  </Name>
                </DriverProfile>
                <VehLink>
                  <DriverID>00000216</DriverID>
                  <ID>1</ID>
                  <VehicleID>00000215</VehicleID>
                </VehLink>
                <VehLink>
                  <DriverID>00000217</DriverID>
                  <ID>2</ID>
                  <VehicleID>00000215</VehicleID>
                </VehLink>
              </QuoteInfo>
            </Auto>
          </CodeNames>
        </FortusTransaction>
      </xmlparam_ExtendedInput>
      <xmlparam_CarrierInfo>
        <RBCarrierInfo xmlns="">
          <Group>
            <Carriers>
              <GRP />
              <WU />
            </Carriers>
            <Credentials>
              <UserName>intactcredentials</UserName>
              <Password>abc123</Password>
            </Credentials>
            <Consent>Y</Consent>
          </Group>
          <Group>
            <Carriers>
              <AXA />
            </Carriers>
            <Credentials>
              <UserName>axacredentials</UserName>
              <Password>xyz789</Password>
            </Credentials>
            <Consent>Y</Consent>
          </Group>
        </RBCarrierInfo>
      </xmlparam_CarrierInfo>
    </Rate>
  </soap:Body>
</soap:Envelope>